{
  "_class_name": "DDIMScheduler",
  "_diffusers_version": "0.24.0.dev0",
  "beta_end": 0.0155,
  "beta_schedule": "scaled_linear",
  "beta_start": 0.0015,
  "clip_sample": false,
  "clip_sample_range": 1.0,
  "dynamic_thresholding_ratio": 0.995,
  "num_train_timesteps": 1000,
  "prediction_type": "epsilon",
  "rescale_betas_zero_snr": false,
  "sample_max_value": 1.0,
  "set_alpha_to_one": true,
  "steps_offset": 1,
  "thresholding": false,
  "timestep_spacing": "leading",
  "trained_betas": null
}
