{
  "_class_name": "UNet2DModel",
  "_diffusers_version": "0.24.0.dev0",
  "_name_or_path": "/Users/hyeokseung/.cache/huggingface/hub/models--CompVis--ldm-super-resolution-4x-openimages/snapshots/0b55ddf931a8e3a1b426b3a50ddcf325ff84f668/unet",
  "act_fn": "silu",
  "add_attention": true,
  "attention_head_dim": 32,
  "attn_norm_num_groups": null,
  "block_out_channels": [
    160,
    320,
    320,
    640
  ],
  "center_input_sample": false,
  "class_embed_type": null,
  "down_block_types": [
    "DownBlock2D",
    "DownBlock2D",
    "DownBlock2D",
    "AttnDownBlock2D"
  ],
  "downsample_padding": 1,
  "downsample_type": "conv",
  "dropout": 0.0,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 6,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_class_embeds": null,
  "num_train_timesteps": null,
  "out_channels": 3,
  "resnet_time_scale_shift": "default",
  "sample_size": 64,
  "time_embedding_type": "positional",
  "up_block_types": [
    "AttnUpBlock2D",
    "UpBlock2D",
    "UpBlock2D",
    "UpBlock2D"
  ],
  "upsample_type": "conv"
}
