{
  "_class_name": "LDMSuperResolutionPipeline",
  "_diffusers_version": "0.24.0.dev0",
  "_name_or_path": "CompVis/ldm-super-resolution-4x-openimages",
  "scheduler": [
    "diffusers",
    "DDIMScheduler"
  ],
  "unet": [
    "diffusers",
    "UNet2DModel"
  ],
  "vqvae": [
    "diffusers",
    "VQModel"
  ]
}
